Revit 2024 API
TreadNosingPosition Enumeration
 Represents on which edges of the nosing to apply the nosing profile.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum TreadNosingPosition
Visual Basic
Public Enumeration TreadNosingPosition
Visual C++
public enum class TreadNosingPosition
Members
Member name | Description
FrontOnly |  Adds nosing on the front edge of tread only.
FrontAndLeft |  Adds nosing on the front and left edge of tread.
FrontAndRight |  Adds nosing on the front and right edge of tread.
FrontLeftAndRight |  Adds nosing on the front left and left edge of tread.
See Also
Autodesk.Revit.DB.Architecture Namespace